In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('empleados.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nombre              933 non-null    object
 1   Genero              854 non-null    object
 2   Fecha Contratacion  999 non-null    object
 3   Salario             999 non-null    float64
 4   Definitivo          933 non-null    object
 5   Equipo              957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [4]:
marketing=df['Equipo']=='Marketing'
ventas=df['Equipo']=='Ventas'
legal=df['Equipo']=='Legal'

In [6]:
df[marketing|ventas|legal].head(5)

     Nombre     Genero Fecha Contratacion   Salario Definitivo     Equipo
0   Douglas  Masculino         08/06/1993       NaN       True  Marketing
5    Dennis  Masculino            4/18/87  115163.0      False      Legal
11    Julie   Femenino           10/26/97  102508.0       True      Legal
13     Gary  Masculino            1/27/08  109831.0      False     Ventas
20     Lois        NaN            4/22/95   64714.0       True      Legal

In [ ]:
# Aldair de Jesus De Leon Hernandez
#Actividad Salarios
#Actividad BÃ¡sica

In [8]:
salario_min=df[df['Salario']>0]['Salario'].min()

In [9]:
salario_max=df[df['Salario']>0]['Salario'].max()

In [12]:
salario_max-salario_min

114895.0

In [ ]:
#Actividad avanzada

In [14]:
df['Salario'].describe()

count       999.000000
mean      90655.528529
std       32939.511615
min       35013.000000
25%       62560.000000
50%       90427.000000
75%      118744.500000
max      149908.000000
Name: Salario, dtype: float64

In [15]:
df['Salario'].mean()

90655.52852852854

In [18]:
df['Salario'].std()

32939.511614864416

In [22]:
df['Salario'].median()

90427.0